{
  "characters": [
    {
      "id": "1",
      "name": "Iron Man / Tony Stark",
      "shortDescription": "The character was co-created by writer and editor Stan Lee, developed by scripter Larry Lieber, and designed by artists Don Heck and Jack Kirby. The character made his first appearance in Tales of Suspense #39 (cover dated March 1963), and received his own title in Iron Man #1 (May 1968). Also in 1963, the character founded the Avengers alongside Thor, Ant-Man, Wasp and the Hulk.",
      "description": "A wealthy American business magnate, playboy, philanthropist, inventor and ingenious scientist, Anthony Edward Tony Stark suffers a severe chest injury during a kidnapping. When his captors attempt to force him to build a weapon of mass destruction, he instead creates a mechanized suit of armor to save his life and escape captivity. Later, Stark develops his suit, adding weapons and other technological devices he designed through his company, Stark Industries. He uses the suit and successive versions to protect the world as Iron Man. Although at first concealing his true identity, Stark eventually publicly reveals himself to be Iron Man.Initially, Iron Man was a vehicle for Stan Lee to explore Cold War themes, particularly the role of American technology and industry in the fight against communism. Subsequent re-imaginings of Iron Man have transitioned from Cold War motifs to contemporary matters of the time.",
      "image": "https://www.seekpng.com/png/detail/3-35725_iron-man-png-photo-iron-man-mark-comic.png"
    },
    {
      "id": "2",
      "name": "Captain American / Steve Roger",
      "shortDescription": "Captain America is a superhero appearing in American comic books published by Marvel Comics. Created by cartoonists Joe Simon and Jack Kirby, the character first appeared in Captain America Comics #1 (cover dated March 1941) from Timely Comics, a predecessor of Marvel Comics.",
      "description": "Captain America was designed as a patriotic supersoldier who often fought the Axis powers of World War II and was Timely Comics most popular character during the wartime period. The popularity of superheroes waned following the war, and the Captain America comic book was discontinued in 1950, with a short-lived revival in 1953. Since Marvel Comics revived the character in 1964, Captain America has remained in publication. The character wears a costume bearing an American flag motif, and he utilizes a nearly-indestructible shield that he throws as a projectile.",
      "image": "https://pngimg.com/uploads/captain_america/captain_america_PNG35.png"
    },
    {
      "id": "3",
      "name": "Thor",
      "shortDescription": "Fictional character appearing in American comic books published by Marvel Comics. The character, which is based on the Norse deity of the same name, is the Asgardian god of thunder who possesses the enchanted hammer, Mjolnir, which grants him the ability to fly and manipulate weather.",
      "description": "Debuting in the Silver Age of Comic Books, the character first appeared in Journey into Mystery #83 (August 1962) and was created by penciller-plotter Jack Kirby, editor-plotter Stan Lee, and scripter Larry Lieber. The character has starred in several ongoing series and limited series, and is a founding member of the superhero team the Avengers, appearing in all volumes of the series. The character has been seen in Marvel Comics merchandise, animated television series, movies, video games, clothing and toys. Thor has a host of supporting characters and enemies.Thor placed 14th on IGN's list of Top 100 Comic Book Heroes of All Time in 2011, and first in their list of The Top 50 Avengers in 2012.",
      "image": "https://www.pngkit.com/png/full/2-25621_thor-free-download-png-thor-png.png"
    },
    {
      "id": "4",
      "name": "SHulk / Bruce Banner",
      "shortDescription": "The Hulk is a fictional character and superhero appearing in publications by the American publisher Marvel Comics. Created by writer Stan Lee and artist Jack Kirby, the character first appeared in the debut issue of The Incredible Hulk (May 1962).",
      "description": "In his comic book appearances, the character is both the Hulk, a green-skinned, hulking and muscular humanoid possessing a vast degree of physical strength, and his alter ego Dr. Robert Bruce Banner, a physically weak, socially withdrawn, and emotionally reserved physicist. The two exist as independent dissociative personalities, and resent each other.Following his accidental exposure to gamma rays saving the life of Rick Jones during the detonation of an experimental bomb, Banner is physically transformed into the Hulk when subjected to emotional stress, at or against his will, often leading to destructive rampages and conflicts that complicate Banner's civilian life. The Hulk's level of strength is normally conveyed as proportionate to his level of anger.",
      "image": "https://www.vippng.com/png/detail/41-417721_marvel-hulk-png.png"
    },
    {
      "id": "5",
      "name": "Black Widow / Natasha Romanoff",
      "shortDescription": "The Black Widow is the name of two fictional characters in the Marvel Universe from the Marvel Comics publishing house.",
      "description": "The first and best known is the Russian spy Natalia Natasha Romanova or Natasha Romanoff. Created by writer Stan Lee and artists Don Rico and Don Heck, she first appeared as Iron Man's enemy in the comic book Tales of Suspense #52 in April 1964, but later repurposed as a superhero.The second Black Widow is Yelena Belova, a creation of writer Devin K. Grayson and artist J. G. Jones, first appeared in the comic book Inhumans #5 in March 1999.In the movies, the character of Natasha Romanoff is played by actress Scarlett Johansson, and is part of the team of the original six Avengers in the four Avengers films. She also appears in several other works of the Marvel Cinematic Universe, since the film Iron Man 2 (2010) before being the central character of the film Black Widow released in 2021. The latter also introduces Yelena Belova, played by the actress Florence Pugh.",
      "image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/9179cbc1-3c77-4646-807c-ff7ba5a3019f/de9txs6-8418f5c8-5a81-454e-8bba-19a5133fce10.png/v1/fill/w_1280,h_1945,strp/mcu_black_widow_png_by_marvelboi199999_de9txs6-fullview.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MTk0NSIsInBhdGgiOiJcL2ZcLzkxNzljYmMxLTNjNzctNDY0Ni04MDdjLWZmN2JhNWEzMDE5ZlwvZGU5dHhzNi04NDE4ZjVjOC01YTgxLTQ1NGUtOGJiYS0xOWE1MTMzZmNlMTAucG5nIiwid2lkdGgiOiI8PTEyODAifV1dLCJhdWQiOlsidXJuOnNlcnZpY2U6aW1hZ2Uub3BlcmF0aW9ucyJdfQ.L6OEgBS5QIpEzTlgnit4hJCGkpCu5CJkbRn71LM4E-4"
    },
    {
      "id": "6",
      "name": "Spider-Man / Peter Parker",
      "shortDescription": "Spider-Man is a superhero created by writer-editor Stan Lee and writer-artist Steve Ditko. He first appeared in the anthology comic book Amazing Fantasy #15 (Aug. 1962) in the Silver Age of Comic Books.",
      "description": "In the stories, he is an orphan raised by his Aunt May and Uncle Ben in New York City after his parents Richard and Mary Parker died in a plane crash.His origin story has him acquiring spider-related abilities after a bite from a radioactive spider; these include clinging to surfaces, superhuman strength and agility, and detecting danger with his spider-sense. He then builds wrist-mounted web-shooter devices that shoot artificial spider-webbing of his own design.When Spider-Man first appeared in the early 1960s, teenagers in superhero comic books were usually relegated to the role of sidekick to the protagonist. The Spider-Man series broke ground by featuring Peter Parker, a high school student from Queens behind Spider-Man's secret identity and with whose self-obsessions with rejection, inadequacy, and loneliness young readers could relate.",
      "image": "https://www.seekpng.com/png/detail/206-2064749_download-spiderman-png-cartoon.png"
    },
    {
      "id": "7",
      "name": "Ant-Man / Scott Lang",
      "shortDescription": "Created by Stan Lee, Larry Lieber and Jack Kirby, Ant-Man's first appearance was in Tales to Astonish #35 (September 1962). He is inspired by other arthropod based superheroes like Spider-Man and the Human Centipede.",
      "description": "Scott Lang was a thief who became Ant-Man after stealing the Ant-Man suit to save his daughter Cassandra Cassie Lang from a heart condition. Reforming from his life of crime, Lang soon took on a full-time career as Ant-Man with the encouragement of Hank Pym. He became an affiliate of the Fantastic Four, and later became a full-time member of the Avengers. For a period of time he dated Jessica Jones. He was killed by the Scarlet Witch along with the Vision and Hawkeye in Avengers Disassembled, and his daughter took up his heroic mantle as Stature in the book Young Avengers. He returned to life in 2011 in the mini series, The Children's Crusade, but lost his daughter when she heroically sacrificed herself to stop a super charged Doctor Doom, who would later revive her during the AXIS.",
      "image": "http://assets.stickpng.com/images/580b57fbd9996e24bc43c014.png"
    },
    {
      "id": "8",
      "name": "Gamora",
      "shortDescription": "Gamora Zen Whoberi Ben Titan is a fictional character appearing in American comic books published by Marvel Comics. Created by writer/artist Jim Starlin, the character first appeared in Strange Tales #180 (June 1975). Gamora is the last of her species.",
      "description": "Her powers include superhuman strength and agility and an accelerated healing factor. She also is an elite combatant, being able to beat most of the opponents in the galaxy. She is a member of the superhero group known as the Infinity Watch.The character played a role in the 2007 crossover comic book event "Annihilation: Conquest", becoming a member of the titular team in its spin-off comic, Guardians of the Galaxy, before becoming the supervillain Requiem in the 2018 crossover comic book events Infinity Countdown and Wars.",
      "image": "https://www.seekpng.com/png/detail/127-1278387_gamora-animated-render-02-gamora-guardians-of-the.png"
    },
    {
      "id": "9",
      "name": "Black Panther / T’Challa",
      "shortDescription": "Black Panther is a fictional character appearing in American comic books published by Marvel Comics. The character was created by writer-editor Stan Lee and writer-artist Jack Kirby, first appearing in Fantastic Four #52 (cover-dated July 1966) in the Silver Age of Comic Books.",
      "description": "Black Panther's real name is T'Challa, and he is depicted as the king and protector of the fictional African nation of Wakanda. Along with possessing enhanced abilities achieved through ancient Wakandan rituals of drinking the essence of the heart-shaped herb, T'Challa also relies on his proficiency in science, rigorous physical training, hand-to-hand combat skills, and access to wealth and advanced Wakandan technology to combat his enemies.Black Panther is the first superhero of African descent in mainstream American comics, having debuted years before early black superheroes such as Marvel Comics' the Falcon (1969), Luke Cage (1972), and Blade (1973) or DC Comics' John Stewart in the role of Green Lantern (1971).",
      "image": "https://www.nicepng.com/png/detail/45-450763_png-pantera-negra-black-panther-png.png"
    },
    {
      "id": "10",
      "name": "Captain Marvel / Carol Danvers",
      "shortDescription": "Carol Danvers is a fictional character portrayed by Brie Larson in the Marvel Cinematic Universe (MCU) film franchise—based on the Marvel Comics character of the same name—commonly known by her alter ego, Captain Marvel.",
      "description": "In the films, Danvers is a former U.S. Air Force fighter pilot who was given superhuman abilities when a light-speed engine test went wrong and she was exposed to the cosmic energy of the Tesseract and subsequently transformed into a Human-Kree hybrid via blood transfusion.As of April 2021, the character has appeared in two films, Captain Marvel and Avengers: Endgame, and her voice was heard in an episode of WandaVision. Danvers will return in the upcoming film The Marvels, as well as the animated Disney+ series What If...?.Larson described Danvers as a "believer in truth and justice" and a "bridge between Earth and space", who must balance her unemotional Kree side with her "flawed" human half. Larson also called Danvers aggressive, quick-tempered, and invasive—attributes that help her in a fight but prove to be character flaws.",
      "image": "https://i.pinimg.com/originals/0d/cd/71/0dcd71e130eae8b396e62e7d9948b7de.png"
    }
  ]
}
